<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Self Join
    <ul>A self join in SQL is a specific type of join where a table is joined with itself. </ul>
    <ul>This is useful when you want to combine rows from the same table based on related columns.</ul>
        <ul>In a self join, you use table aliases to distinguish between the different uses of the same table.</ul>
                </div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Self join are used when you want to campare the values of two different rows within the same table
</div>

In [6]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/csv_data

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%%sql
SELECT * FROM usr

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(1, 'Nitish', 34, 11),
 (2, 'Ankit', 32, 1),
 (3, 'Neha', 23, 1),
 (4, 'Radhika', 34, 3),
 (8, 'Abhinav', 31, 11),
 (11, 'Rahul', 29, 8)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now here user_id 1 name Nitish are the emergency contact of 11 and 11 user_id name is Rahul
</div>

In [14]:
%%sql
SELECT * FROM usr t1
JOIN usr t2
ON t1.user_id = t2.emergency_contact

LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(11, 'Rahul', 29, 8, 1, 'Nitish', 34, 11)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Complete data
</div>

In [16]:
%%sql
SELECT * FROM usr t1
JOIN usr t2
ON t1.user_id = t2.emergency_contact

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(11, 'Rahul', 29, 8, 1, 'Nitish', 34, 11),
 (1, 'Nitish', 34, 11, 2, 'Ankit', 32, 1),
 (1, 'Nitish', 34, 11, 3, 'Neha', 23, 1),
 (3, 'Neha', 23, 1, 4, 'Radhika', 34, 3),
 (11, 'Rahul', 29, 8, 8, 'Abhinav', 31, 11),
 (8, 'Abhinav', 31, 11, 11, 'Rahul', 29, 8)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Cross Join or Cartesian Product<br>
    <ul>Cross join (also known as a Cartesian join) is a type of join that returns the Cartesian product of two tables.</ul>
    <ul>This means that it combines each row from the first table with every row from the second table, resulting in every possible combination of rows.</ul>
    <ul>The total number of rows in the result set is the product of the number of rows in the two tables being joined.</ul>
</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Table cr1</div>

In [25]:
%%sql
SELECT * FROM cr1

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('A',), ('B',), ('C',)]

### Table cr2

In [26]:
%%sql
SELECT * FROM cr2

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('D',), ('E',), ('F',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now Create all possible combination
</div>

In [29]:
%%sql
SELECT * FROM cr1 t1
CROSS JOIN cr2 t2

 * mysql+pymysql://root:***@localhost:3307/csv_data
9 rows affected.

[('A', 'D'),
 ('B', 'D'),
 ('C', 'D'),
 ('A', 'E'),
 ('B', 'E'),
 ('C', 'E'),
 ('A', 'F'),
 ('B', 'F'),
 ('C', 'F')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note! in CROSS JOIN Condition (ON) are not Allow
</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Joining on More than one Cols
</div>


<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">students table
</div>

In [30]:
%%sql
SELECT * FROM students

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(1, 'John', 'Smith', 1, 2021),
 (2, 'Jane', 'Doe', 2, 2020),
 (3, 'Bob', 'Johnson', 1, 2021),
 (4, 'Sally', 'Brown', 3, 2022),
 (5, 'Tom', 'Williams', 2, 2022),
 (6, 'Alice', 'Davis', 4, 2020)]



<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">class table
</div>

In [32]:
%%sql
SELECT * FROM class

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[(1, 'Math 101', 'Mr. Smith', 2021),
 (2, 'English 1', 'Ms. Johnson', 2021),
 (3, 'Science 1', 'Dr. Lee', 2022),
 (4, 'History 1', 'Ms. Williams', 2022)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
    <ul>In the students table, John Smith is in class ID 1, and his enrollment year is 2021. </ul>
    <ul>In the class table, for class ID 1, both John Smith and Bob Johnson have Mr. Smith as their teacher. </ul>
    <ul>Now, if we join the data based on class ID, all the data will be merged. </ul>
    <ul>This means we need to join based on both class year and enrollment year, </ul>
    <ul>so we'll perform a join using these two columns.</ul>
</div>

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Join on Single column</div>

In [40]:
%%sql

SELECT * FROM students t1
INNER JOIN class t2
ON t1.class_id = t2.class_id

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(1, 'John', 'Smith', 1, 2021, 1, 'Math 101', 'Mr. Smith', 2021),
 (2, 'Jane', 'Doe', 2, 2020, 2, 'English 1', 'Ms. Johnson', 2021),
 (3, 'Bob', 'Johnson', 1, 2021, 1, 'Math 101', 'Mr. Smith', 2021),
 (4, 'Sally', 'Brown', 3, 2022, 3, 'Science 1', 'Dr. Lee', 2022),
 (5, 'Tom', 'Williams', 2, 2022, 2, 'English 1', 'Ms. Johnson', 2021),
 (6, 'Alice', 'Davis', 4, 2020, 4, 'History 1', 'Ms. Williams', 2022)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Join on Two column</div>

In [45]:
%%sql

SELECT * FROM students t1
INNER JOIN class t2
ON t1.class_id = t2.class_id
AND t1.enrollment_year = t2.class_year

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'John', 'Smith', 1, 2021, 1, 'Math 101', 'Mr. Smith', 2021),
 (3, 'Bob', 'Johnson', 1, 2021, 1, 'Math 101', 'Mr. Smith', 2021),
 (4, 'Sally', 'Brown', 3, 2022, 3, 'Science 1', 'Dr. Lee', 2022)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Join on Multiple Columns</div>

#### Category table

In [55]:
%%sql
SELECT * FROM category
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[(1, 'Furniture', 'Bookcases'),
 (2, 'Clothing', 'Stole'),
 (3, 'Clothing', 'Hankerchief'),
 (4, 'Electronics', 'Electronic Games'),
 (5, 'Electronics', 'Phones')]

#### order_details table

In [56]:
%%sql
SELECT * FROM order_details
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('B-25601', 1275.0, -1148.0, 7, 1),
 ('B-25614', 494.0, 54.0, 4, 1),
 ('B-25618', 362.0, 127.0, 1, 1),
 ('B-25638', 182.0, -11.0, 3, 1),
 ('B-25643', 1061.0, -36.0, 8, 1)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">orders table</div>

In [57]:
%%sql
SELECT * FROM orders
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('B-25601', 1, '01-04-2018'),
 ('B-26011', 1, '12-02-2019'),
 ('B-26074', 1, '21-03-2019'),
 ('B-25602', 2, '01-04-2018'),
 ('B-26012', 2, '13-02-2019')]


<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">users table</div>

In [58]:
%%sql
SELECT * FROM users
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[(1, 'Bharat', 'Gujarat', 'Ahmedabad'),
 (2, 'Pearl', 'Maharashtra', 'Pune'),
 (3, 'Jahan', 'Madhya Pradesh', 'Bhopal'),
 (4, 'Divsha', 'Rajasthan', 'Jaipur'),
 (5, 'Kasheen', 'West Bengal', 'Kolkata')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">1 Single Join<ul>Join users.user_id with orders.user_id</ul>
</div>

In [65]:
%%sql 

SELECT * FROM users t1
INNER JOIN orders t2
ON t1.user_id = t2.user_id

LIMIT 6

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(1, 'Bharat', 'Gujarat', 'Ahmedabad', 'B-25601', 1, '01-04-2018'),
 (1, 'Bharat', 'Gujarat', 'Ahmedabad', 'B-26011', 1, '12-02-2019'),
 (1, 'Bharat', 'Gujarat', 'Ahmedabad', 'B-26074', 1, '21-03-2019'),
 (2, 'Pearl', 'Maharashtra', 'Pune', 'B-25602', 2, '01-04-2018'),
 (2, 'Pearl', 'Maharashtra', 'Pune', 'B-26012', 2, '13-02-2019'),
 (2, 'Pearl', 'Maharashtra', 'Pune', 'B-26075', 2, '21-03-2019')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">2 Double Join<ul>Join on order_id with order_details.orders_id</ul>
</div>

In [69]:
%%sql 

SELECT * FROM users t1
INNER JOIN orders t2
ON t1.user_id = t2.user_id

JOIN order_details t3
ON t2.order_id = t3.order_id 

LIMIT 6

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(1, 'Bharat', 'Gujarat', 'Ahmedabad', 'B-25601', 1, '01-04-2018', 'B-25601', 1275.0, -1148.0, 7, 1),
 (14, 'Vandana', 'Himachal Pradesh', 'Simla', 'B-25614', 14, '13-04-2018', 'B-25614', 494.0, 54.0, 4, 1),
 (18, 'Manju', 'Andhra Pradesh', 'Hyderabad', 'B-25618', 18, '18-04-2018', 'B-25618', 362.0, 127.0, 1, 1),
 (38, 'Parth', 'Maharashtra', 'Pune', 'B-25638', 38, '26-04-2018', 'B-25638', 182.0, -11.0, 3, 1),
 (43, 'Kirti', 'Jammu and Kashmir', 'Kashmir', 'B-25643', 43, '29-04-2018', 'B-25643', 1061.0, -36.0, 8, 1),
 (51, 'Anurag', 'Madhya Pradesh', 'Indore', 'B-25651', 51, '07-05-2018', 'B-25651', 200.0, -60.0, 4, 1)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">3 TRIPLE Join<ul>Join on category_id with category.category_id</ul>
</div>

In [71]:
%%sql 

SELECT * FROM users t1
INNER JOIN orders t2
ON t1.user_id = t2.user_id

INNER JOIN order_details t3
ON t2.order_id = t3.order_id 

INNER JOIN category t4
ON t3.category_id = t4.category_id

LIMIT 6

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(1, 'Bharat', 'Gujarat', 'Ahmedabad', 'B-25601', 1, '01-04-2018', 'B-25601', 1275.0, -1148.0, 7, 1, 1, 'Furniture', 'Bookcases'),
 (14, 'Vandana', 'Himachal Pradesh', 'Simla', 'B-25614', 14, '13-04-2018', 'B-25614', 494.0, 54.0, 4, 1, 1, 'Furniture', 'Bookcases'),
 (18, 'Manju', 'Andhra Pradesh', 'Hyderabad', 'B-25618', 18, '18-04-2018', 'B-25618', 362.0, 127.0, 1, 1, 1, 'Furniture', 'Bookcases'),
 (38, 'Parth', 'Maharashtra', 'Pune', 'B-25638', 38, '26-04-2018', 'B-25638', 182.0, -11.0, 3, 1, 1, 'Furniture', 'Bookcases'),
 (43, 'Kirti', 'Jammu and Kashmir', 'Kashmir', 'B-25643', 43, '29-04-2018', 'B-25643', 1061.0, -36.0, 8, 1, 1, 'Furniture', 'Bookcases'),
 (51, 'Anurag', 'Madhya Pradesh', 'Indore', 'B-25651', 51, '07-05-2018', 'B-25651', 200.0, -60.0, 4, 1, 1, 'Furniture', 'Bookcases')]

#### <br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">For Understanding<ul style='font-size:18px;'>users.user_id -> orders.user_id (orders.order_id) -> order_details.order_id (order_details.category_id)-> category.order_id</ul>
</div>


<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Same Join without alias</div>

In [80]:
%%sql 

SELECT * FROM users
INNER JOIN orders
ON users.user_id = orders.user_id # users.user_id -> orders.user_id

INNER JOIN order_details
ON orders.order_id = order_details.order_id  # orders.order_id -> order_details.order_id

INNER JOIN category
ON order_details.category_id = category.category_id # order_details.order_id -> category.order_id

LIMIT 6

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[(1, 'Bharat', 'Gujarat', 'Ahmedabad', 'B-25601', 1, '01-04-2018', 'B-25601', 1275.0, -1148.0, 7, 1, 1, 'Furniture', 'Bookcases'),
 (14, 'Vandana', 'Himachal Pradesh', 'Simla', 'B-25614', 14, '13-04-2018', 'B-25614', 494.0, 54.0, 4, 1, 1, 'Furniture', 'Bookcases'),
 (18, 'Manju', 'Andhra Pradesh', 'Hyderabad', 'B-25618', 18, '18-04-2018', 'B-25618', 362.0, 127.0, 1, 1, 1, 'Furniture', 'Bookcases'),
 (38, 'Parth', 'Maharashtra', 'Pune', 'B-25638', 38, '26-04-2018', 'B-25638', 182.0, -11.0, 3, 1, 1, 'Furniture', 'Bookcases'),
 (43, 'Kirti', 'Jammu and Kashmir', 'Kashmir', 'B-25643', 43, '29-04-2018', 'B-25643', 1061.0, -36.0, 8, 1, 1, 'Furniture', 'Bookcases'),
 (51, 'Anurag', 'Madhya Pradesh', 'Indore', 'B-25651', 51, '07-05-2018', 'B-25651', 200.0, -60.0, 4, 1, 1, 'Furniture', 'Bookcases')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">FILTER COLUMNS
</div>

In [100]:
%%sql 

SELECT 

users.city,
orders.order_id  

FROM users

INNER JOIN orders
ON users.user_id = orders.user_id # users.user_id -> orders.user_id



LIMIT 6

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[('Ahmedabad', 'B-25601'),
 ('Ahmedabad', 'B-26011'),
 ('Ahmedabad', 'B-26074'),
 ('Pune', 'B-25602'),
 ('Pune', 'B-26012'),
 ('Pune', 'B-26075')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Filter on multiple columns
</div>

In [101]:
%%sql 

SELECT 

users.city,

-- # ======================
orders.order_id ,

-- # ======================

order_details.category_id,

-- # ======================
category.vertical,
category.category


FROM users

INNER JOIN orders
ON users.user_id = orders.user_id # users.user_id -> orders.user_id

-- # ---------------------------------------------------------

INNER JOIN order_details
ON orders.order_id = order_details.order_id  # orders.order_id -> order_details.order_id

-- # ---------------------------------------------------------

INNER JOIN category
ON order_details.category_id = category.category_id # order_details.order_id -> category.order_id


LIMIT 6

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[('Ahmedabad', 'B-25601', 1, 'Furniture', 'Bookcases'),
 ('Simla', 'B-25614', 1, 'Furniture', 'Bookcases'),
 ('Hyderabad', 'B-25618', 1, 'Furniture', 'Bookcases'),
 ('Pune', 'B-25638', 1, 'Furniture', 'Bookcases'),
 ('Kashmir', 'B-25643', 1, 'Furniture', 'Bookcases'),
 ('Indore', 'B-25651', 1, 'Furniture', 'Bookcases')]


<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find order_id, name and city by joining users and orders table
</div>

In [105]:
%%sql

SELECT 

users.name,users.city

FROM users

INNER JOIN orders
ON users.user_id = orders.user_id

LIMIT 6

 * mysql+pymysql://root:***@localhost:3307/csv_data
6 rows affected.

[('Bharat', 'Ahmedabad'),
 ('Bharat', 'Ahmedabad'),
 ('Bharat', 'Ahmedabad'),
 ('Pearl', 'Pune'),
 ('Pearl', 'Pune'),
 ('Pearl', 'Pune')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find order_id, product_id by joining order_details and category table
</div>

In [113]:
%sql SELECT * FROM order_details LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('B-25601', 1275.0, -1148.0, 7, 1)]

In [114]:
%sql SELECT * FROM category LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(1, 'Furniture', 'Bookcases')]

In [158]:
%%sql

SELECT 

order_details.order_id,
category.category

FROM order_details

INNER JOIN category
ON order_details.category_id = category.category_id

LIMIT 77,4

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[('B-26081', 'Bookcases'),
 ('B-26093', 'Bookcases'),
 ('B-25601', 'Stole'),
 ('B-25603', 'Stole')]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">FILTER ON ROWS (WHERE)</div>

In [172]:
%%sql 

SELECT 

users.city,

-- # ====================== #  here -- use for sql comment
orders.order_id ,

-- # ======================

order_details.category_id,

-- # ======================
category.vertical,
category.category


FROM users 

INNER JOIN orders
ON users.user_id = orders.user_id # users.user_id -> orders.user_id

-- # ---------------------------------------------------------

INNER JOIN order_details
ON orders.order_id = order_details.order_id  # orders.order_id -> order_details.order_id

-- # ---------------------------------------------------------

INNER JOIN category
ON order_details.category_id = category.category_id # order_details.order_id -> category.order_id

WHERE orders.order_id = "B-25601"

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[('Ahmedabad', 'B-25601', 1, 'Furniture', 'Bookcases'),
 ('Ahmedabad', 'B-25601', 2, 'Clothing', 'Stole'),
 ('Ahmedabad', 'B-25601', 3, 'Clothing', 'Hankerchief'),
 ('Ahmedabad', 'B-25601', 4, 'Electronics', 'Electronic Games')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find all orders placed in pune and order year 2019<ul>join on orders and users</ul></div>

In [182]:
%%sql
SELECT * FROM orders
INNER JOIN users
ON orders.user_id = users.user_id

WHERE users.city = "Pune" AND orders.order_date LIKE "%2019%"

 * mysql+pymysql://root:***@localhost:3307/csv_data
10 rows affected.

[('B-26012', 2, '13-02-2019', 2, 'Pearl', 'Maharashtra', 'Pune'),
 ('B-26075', 2, '21-03-2019', 2, 'Pearl', 'Maharashtra', 'Pune'),
 ('B-26030', 20, '21-02-2019', 20, 'Sarita', 'Maharashtra', 'Pune'),
 ('B-26093', 20, '27-03-2019', 20, 'Sarita', 'Maharashtra', 'Pune'),
 ('B-26048', 38, '04-03-2019', 38, 'Parth', 'Maharashtra', 'Pune'),
 ('B-26066', 56, '16-03-2019', 56, 'Priyanka', 'Maharashtra', 'Pune'),
 ('B-25944', 344, '10-01-2019', 344, 'Syed', 'Maharashtra', 'Pune'),
 ('B-25948', 348, '13-01-2019', 348, 'Mukund', 'Maharashtra', 'Pune'),
 ('B-25955', 355, '16-01-2019', 355, 'Soumya', 'Maharashtra', 'Pune'),
 ('B-25962', 362, '19-01-2019', 362, 'Tejeswini', 'Maharashtra', 'Pune')]

<hr>
<div style="text-align:left; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Summary
<ul>Self JOIN</ul>
<ul>Cross JOIN</ul>
<ul>Multiple JOINS</ul>
<ul>Join on Single/Double columns</ul>

</div>